{
    "version": "https://jsonfeed.org/version/1",
    "title": "Lauren Hinton",
    "description": "",
    "home_page_url": "https://laurenhinton.co",
    "feed_url": "https://laurenhinton.co/feed.json",
    "user_comment": "",
    "author": {
        "name": "Lauren Hinton"
    },
    "items": [
        {
            "id": "https://laurenhinton.co/platform.html",
            "url": "https://laurenhinton.co/platform.html",
            "title": "Platform",
            "summary": "Platform February 26, 2026 I’m 30 days into my new gig and I haven’t stopped obsessing over how to articulate&hellip;",
            "content_html": "<h1 class=\"lh-post-title-heading\">Platform</h1>\n<div class=\"lh-post-date-single\">February 26, 2026</div>\n<p><span style=\"font-weight: 400;\"> I’m 30 days into my new gig and I haven’t stopped obsessing over how to articulate and define what my new gig is. By title, I’m on the “platform” team. “Platform” in this case meaning my sole purpose is to help portfolio companies get to their next round of fundraising, with a specific focus on the GTM/revenue side. In an ideal world, preferably at a step up as well. I used platform in quotes because it turns out platform has a very different meaning at each firm with some firms not even having a designated platform side, though it’s becoming more common.</span></p>\n<p><span style=\"font-weight: 400;\"> It has felt a little strange going from being on the investing side: a lovable grind of endless meetings with founders, investor dinners, conferences, memos, etc. to waiting in the starting gate for money to wire and the post-check work to begin. A part of me misses that specific hustle, but I’m starting to find a real challenge and different hustle in providing for a founder after officially earning a spot on their cap table. To which I would argue that to win a spot a firm needs to add value to the founder long before any term sheet is presented.</span></p>\n<p><span style=\"font-weight: 400;\"> Venture is changing (resetting even, as Benjamin Black so eloquently, and slightly alarmingly, detailed in his newsletter Liquid Thinking), and the way people interact and support founders is changing. I think in the beginning, when the idea of a platform team was even more obscure than it is today, founders were promised customer intros and hiring help, and basically an added extension to their team through platform. The reasons given to founders from VCs today remain pretty similar but I think what’s changing is the optionality for these founders. Lots of firms are adding platform teams that involve talent, community, BD, etc. and every firm’s table stakes differentiator is the same: customer intros and hiring…and maybe lowering AI costs as that is becoming more relevant. Firms are all promising the same things and founders have options.</span></p>\n<p><span style=\"font-weight: 400;\"> Remove the megafunds, the Sequoia’s and the a16z’s of the world, and founders still have such a competitive pool of options to pick from when it comes to investors. They also have the option to bypass funding altogether (lower headcount costs through implementing AI, seed-straping, second-time-founders-going all-in-with-their-own-money-because-why-not). It’s a brand new world and the pendulum shift is seeming to be more and more in favor of the founder. So how do you build trust to win the founder and keep the founder? This idea of not just seeing the deal but winning the deal and making sure it has the right resources to succeed has been all-consuming.</span></p>\n<p><span style=\"font-weight: 400;\"> My hypothesis of where the platform side provides the most value lies somewhere at the intersection of traditional platform work (strategy, hiring, advisory) and community. A partner once told me that a community cannot simply exist. You have to nurture it and you have to provide it with something useful. The tough part is figuring out which incentives actually motivate people to join a community. One that can grow into a broader network and later be thoughtfully activated when appropriate. “Community” in and of itself is broad. Does community in this sense center around partnerships, past founders who want to support in return for equity, GTM councils, or simply gatherings of individuals that enjoy doing similar things?</span></p>\n<p><span style=\"font-weight: 400;\"> The ambiguous nature of platform can at times feel silly. What does platform do and what does one platform team do better than the next is a question I’m actively trying to answer. I think the future of the platform role in venture is what most respected investors already do, or will do, to remain competitive. In my mind it starts with building trust. I don’t have a clear answer for what platform does, or should do, just yet. What I do know is what platform looked like in the early days versus what it has become today is vastly different.</span></p>\n<p><span style=\"font-weight: 400;\"> Stay tuned as I continue to ponder what being on the platform side means and remain both excited and slightly clueless about how it will evolve. </span></p>",
            "author": {
                "name": "Lauren Hinton"
            },
            "tags": [
            ],
            "date_published": "2026-02-26T22:52:27-05:00",
            "date_modified": "2026-02-26T22:52:27-05:00"
        },
        {
            "id": "https://laurenhinton.co/a-light-lunch.html",
            "url": "https://laurenhinton.co/a-light-lunch.html",
            "title": "A Light Lunch",
            "summary": "A Light Lunch January 31, 2026 If you have read anything of mine, or have endured one of my soap&hellip;",
            "content_html": "<h1 class=\"lh-post-title-heading\">A Light Lunch</h1>\n<div class=\"lh-post-date-single\">January 31, 2026</div>\n<p><span style=\"font-weight: 400;\">If you have read anything of mine, or have endured one of my soap box chats (over some good food or a nice beverage to ease the pain), you have an inkling that I fixate on intentionality and try my hardest to live by that method. I’ve also (internally) stated that I want to write at least once a month, so when mid-January arrived and NOTHING that seemed even the slightest intriguing entered my brain, I wondered if my ambitions were mightier than my keyboard. We all know the “people abandon their resolutions two weeks into January” stat and there was genuine concern that I would be falling victim to that “Quitter’s Day” trope.</span></p>\n<p><span style=\"font-weight: 400;\">My fears dwindled when an email landed in my inbox accompanied by an invitation to attend a lunch with a dear friend of mine. On any other day, attending a lunch on January 16th with this friend would have been impossible: 12:30pm on a Friday outside the city is tough…unless you have the luxury of time, then anything goes. Not to mention, this friend is an angel of a human, an absolute superstar, and someone that I don’t get to see as much as I wish I could. Needless to say, I was sitting on a train at 10am watching the city rush past and looking forward to catching up over what I could only assume would be a great meal.</span></p>\n<p><span style=\"font-weight: 400;\">Upon arrival, I quickly learned that this invitation was sent to an intimate group whose attendees ranged from various fields including the corporate side, the doctors, and the policy folk. I want to clarify that my particular invitation was not intended to equate me to the other lunch participants. I was purely there to catch up with my friend, but I found myself lucky enough to sit at the same table as these guests. I’ll pause to acknowledge that this description is a bit vague, dare I say…mysterious? It’s not intended to be. I want to respect my friend and for that I’m withholding invasive details because you just never know who is going to stumble upon this repository of writing.</span></p>\n<p><span style=\"font-weight: 400;\">Anywho, a few of the guests that hailed from the political side of the world had a lot to say. I think anyone, political or not, has a lot to say these days. I’ll be the first to claim that politics is an area I could brush up on. Admittedly, I get disheartened when trying to navigate all that is politics. Politics and politicians have always felt to me a touch performative. A lot of talk with little action. A lot of promises with little follow through. Oh how I was educated at this table on January 16th!</span></p>\n<p><span style=\"font-weight: 400;\">The main takeaway from that discussion was that at a micro level, some things actually get done. There is value in being someone who has their boots on the ground, knows one’s constituents, and devotes everything to solving the problem they campaigned on from the start. The very specific promises, almost a specialization of sorts, are the areas where measurable impact can be seen. The reality of (certain) people getting things done within the political realm got me thinking. Reality check: I know not everything is related to startups or venture or New York but as a free-willing participant in reading this article you are at the mercy of following this comparison.</span></p>\n<p><span style=\"font-weight: 400;\">I kept coming back to the niche issues each person focused on. For example, the woman I sat next to was focused on infant mortality rates in one specific suburb. Her whole job is devoted to this problem and she eats, sleeps, and breathes everything having to do with this issue. An obsession mingled with passion to make things better. Doing one thing extremely well and with extreme ferocity to move the needle. If the correlation hasn’t smacked you in the face off the page yet, I’m writing to say that there was a founder in my midst.</span></p>\n<p><span style=\"font-weight: 400;\">And people thought my fantasy football comparison was bonkers.</span></p>\n<p><span style=\"font-weight: 400;\">Call me crazy, but I had a renewed sense of politics, at least at the local level, that day. It felt like I had entered a world I know nothing about and found it to be oddly similar to the world I know all too well. There are people who experience, relate, or seek out a problem and then obsessively work to fix that problem. It’s a drive that is fueled by various factors but at the highest level its foundation is about working toward making something better. Isn’t that what entrepreneurship and politics are intended to do?</span></p>\n<p><span style=\"font-weight: 400;\">The main conversation was carried out by our host who made it a point to hear from every single person sitting at the table. Not forcefully, but with delicate intention on when it was time for someone new to chime in. It was orchestrated flawlessly and the conversation never seemed to lull. I was perfectly content listening to it all and hearing where each person (founder) was making an impact around the table. I chimed in on a few things in my head. The day in its entirety was full of surprises so I should not have been shocked when our host presented her final question: for the few in attendance just at the start of their journeys, and coming from a younger generation, what are you hopeful about? Talk about a closer!</span></p>\n<p><span style=\"font-weight: 400;\">The youngins at the table, five of us total, piped up. Each of us coming from a different world of our own (corporate, real estate, MBA programming, and venture capital) took the conversation in various directions. With my heart beating wildly out of my chest, caught off guard by my own nervousness to speak, I exclaimed that my bit of hopefulness stemmed from the idea that as our political democracy seems to deteriorate the access to innovation continues to democratize. There has never been a time like the present where accessibility to build has been so widely attainable. I got a few “snaps” at the table and took that as a win.</span></p>\n<p><span style=\"font-weight: 400;\">In plain English, everyone now can be a founder, today more than ever before.</span></p>\n<p><span style=\"font-weight: 400;\">I wish I could better articulate the impact this meal had on me. The reminder that people always have been and always will seek to innovate in their own way was a beautiful reminder. What we work for, what we specialize and obsess over, is worthwhile.</span></p>\n<p><span style=\"font-weight: 400;\">I didn’t get the sense that everyone at that table left feeling hopeful, but I sure did. I was comforted by the knowledge that everyone is building for something and in turn everyone is then a founder. So, I’m here to petition on these final days in January that whatever sector you self-bucket into, remember that you are a founder and that in itself is powerful.</span></p>\n<p><span style=\"font-weight: 400;\">To more thought-provoking gatherings…preferably those that include lunch.</span></p>",
            "author": {
                "name": "Lauren Hinton"
            },
            "tags": [
            ],
            "date_published": "2026-01-31T00:20:02-05:00",
            "date_modified": "2026-02-26T22:52:37-05:00"
        },
        {
            "id": "https://laurenhinton.co/the-village.html",
            "url": "https://laurenhinton.co/the-village.html",
            "title": "The Village",
            "summary": "The Village December 30, 2025 I don’t believe there is a good time to get fired but the nationwide consensus&hellip;",
            "content_html": "<h1 class=\"lh-post-title-heading\">The Village</h1>\n<div class=\"lh-post-date-single\">December 30, 2025</div>\n<p><span style=\"font-weight: 400;\">I don’t believe there is a good time to get fired but the nationwide consensus is that the holiday season (in this case being November 1st-December 31st) is the worst time. I can see why of course. The holidays are associated with extraordinary kindness, reaping rewards from a year of hard work, and overall “new beginnings” with people contemplating whether their current path is the right one and, if not, what they are going to do about it in the months to come. Still, whether it’s July 4th or November 10th, to me, there is never a good time.</span></p>\n<p><span style=\"font-weight: 400;\">No matter the season of the year, you’re forced to evaluate what I label the “reality inducers” - those questions that involve more than five minutes of thought on a Sunday evening. The ones that you devote more contemplation to when the time is right and the stakes are low to give yourself some direction in a world of uncontrollables. Some of these “reality inducers” are questions such as “What do I want to do with my life”, “Am I living in the right place”, “What has my past taught me”, “What are my non-negotiables in a career moving forward.” Each person has their own inducers that hit home on various levels. I notice people are better at thinking about these questions when there are no decisions to make. I can’t say I fell into that bucket, though I wish I was more proactive. That being said, I was recently faced with a plethora of reality-inducers and the one that stuck out the most was “Who is part of your village?”</span></p>\n<p><span style=\"font-weight: 400;\">Whether this thought came from a place of need or panic or was simply out of human curiosity, it got me thinking. Can we handle moments of extreme uncertainty, inevitable low points, or any other causes of anxiety, on our own? I know there is an alternate argument where someone answers “yes” to this question, resilience is a forever chase-able trait, but I’m wondering whether we, as humans, should. There are so many times in life where chaos ensues and you are told to “protect yourself” or “control the narrative.” To me, it’s less about “controlling the narrative” and more about having a say in who is in the narrative. The ones we surround ourselves with rather than those we are circumstantially around.</span></p>\n<p><span style=\"font-weight: 400;\">I thought about this from the lens of a solo founder. Solo founders are never truly alone forever. In the beginning, they hire contractors and may have some part-time hires but eventually they expand their team as their company starts to scale. A solo founder is forced to be picky with who they cultivate relationships with. They are constantly reminded that time is finite and any cultivation could present itself as an opportunity cost to growing their business. In this lens of time scarcity, is it important to have a large village? If not, are relationships intended to be a strategic endeavor? By this I mean, are we allotted a certain number of “close” relationships and the rest of the slots are to be vertically filled? A friend for social engagements, a friend for business connections, a friend who knows every top chef in Manhattan. I bet some people think this way and may even find it efficient.</span></p>\n<p><span style=\"font-weight: 400;\">Countering this view of relationships, and through my own experiences contributing to America’s unemployment rate, I’ve been shown a theme time and time again: the purely human act of relationship building with no means to an end always shows up when you need it. These people in your village are the ones that make their unique presence known when they feel called to do so. This simultaneous thought and truth, as it pertains to my life, has shown me that we should not face these trials alone, and that the most important thing we can devote time to is the connection with someone we have let into our lives and deemed worthy of staying for the long haul.</span></p>\n<p><span style=\"font-weight: 400;\">It’s the simple act of grabbing coffee and being reminded it’s okay to be really down, that unemployment benefits open every Sunday (and that it's best not to accidentally forget a week); being reminded that sometimes you don’t fail but are instead failed by others; being told you can now have a martini on a Tuesday; receiving “WELFARE CHECK” texts or steady “How are you?” check-ins; having people who call because a text just isn’t enough; talking to a best friend’s dad because he’s been there before; being connected to someone’s brother’s best friend’s uncle who might have a slight connection to your intended career; handing over the number of a mom’s former colleague when you’re in a pinch, grabbing tea with no time set to leave; receiving newsletter suggestions and many introductions; going on walks with good company and no end in sight; being mentored in real-time; connecting with people who were you not too long ago; being introduced to service providers who look at you like their client; endless voice memos that exude wisdom and refrain from judgement; more calls when people should be wrapping up the year, more blurbs sent when people are logging off for the holidays; hours of talking where advice is offered freely alongside everything in-between, and so so much more. Nothing explicitly asked. Everything intentionally offered.</span></p>\n<p><span style=\"font-weight: 400;\">These acts are signs of the village working in its purest form. These are relationships I intend to preserve, nourish, and grow as I enter a new stage of venture, and I hope to do the same with founders I meet. I’d love to see their villages grow in a way that makes their jobs even the slightest bit easier, because building a company will never be “easy.” Rumor has it this is exactly what the platform side of venture is intended to do.</span></p>\n<p><span style=\"font-weight: 400;\">So, a sincere thank you to the village I’m building. I hope the current residents know who they are and a reminder that it’s less about “controlling the narrative” and more about contributing to who gets a place within the narrative you find yourself a part of.</span></p>\n<p><span style=\"font-weight: 400;\">To more thoughts in 2026!</span></p>",
            "author": {
                "name": "Lauren Hinton"
            },
            "tags": [
            ],
            "date_published": "2025-12-30T11:06:51-05:00",
            "date_modified": "2025-12-30T11:16:21-05:00"
        },
        {
            "id": "https://laurenhinton.co/thought-haver.html",
            "url": "https://laurenhinton.co/thought-haver.html",
            "title": "Thought Haver",
            "summary": "Thought Haver August 6, 2025 It’s the beginning of August, and I’ve prolonged putting my ideas into writing as much&hellip;",
            "content_html": "<h1 class=\"lh-post-title-heading\">Thought Haver</h1>\n<div class=\"lh-post-date-single\">August 6, 2025</div>\n<p><span style=\"font-weight: 400;\">It’s the beginning of August, and I’ve prolonged putting my ideas into writing as much as I possibly could as my manager side-eyes me, silently questioning my reluctance to emerge onto the personal newsletter scene. I could probably bunker down and hold out for a few more months but, alas, here I am, starting to share. The direction of this writing is unknown, but it is mine, and there is something comforting about that. To the daring few that choose to read on, welcome to my inner monologue.</span></p>\n<p><span style=\"font-weight: 400;\">I’ve coined a new phrase: “thought-haver.” I definitely didn’t coin that, but I‘ve been saying it for the past month or so. If you’ve been on LinkedIn before, I’m sure you’ve already guessed that this is a play on “thought leader.” I’ve always been curious as to who decides when one morphs into a “thought leader.” Is there a Michelin group handing out brains, or perhaps a collective stream of consciousness that votes quarterly on the world’s top thinkers? Either way, it’s all arbitrary. As people pursue the quest for thought leadership, I have been obsessed with in-person human connection. </span></p>\n<p><span style=\"font-weight: 400;\">With all the noise around us, I believe there is value in silence.“Silence” in this context does not mean that one should not have thoughts and opinions and convictions. Silence is taking conversations offline and seeing how they play out when there is another person who can interject on the other side. There is the possibility for interruption, and you are forced to listen and take a moment before you reply. </span></p>\n<p><span style=\"font-weight: 400;\">Most thought leaders are self-appointed, and that’s not something I’m quite comfortable doing. There is so much shared online nowadays, and the earnestness I witness seems to have the opposite effect on me. When someone posts that their family member has passed away on LinkedIn, do I give a condolences thumbs up? I know some people find it cathartic to post these kinds of things, but I struggle to reconcile tech and innovation with my idea of authentic communication. </span></p>\n<p><span style=\"font-weight: 400;\">We’re in the early years of AI, and it excites me more than it scares me (my job paid me to type that - KIDDING). It really does excite me. To know that humans have the potential to be exponentially more productive, and to create without a technical barrier, is one of the coolest things ever. Something not as cool is a growing culture around AI: the cult of scalability. Scale. Scale. Scale. Scale the business, scale the human, scale everything! I’m learning about the importance of scaling certain processes, but from the perspective of human connection, I couldn’t care less about scale. </span></p>\n<p><span style=\"font-weight: 400;\">Authenticity is difficult to scale, and I don’t believe it should. I’ve wrestled with this one for a while. Connecting with people makes me incredibly happy, so why shouldn’t I do it through an online medium where I can, theoretically, connect with way more? And yet I can’t for the life of me click “post.” I have historically opted for the quality over quantity route. My most authentic, most genuine and, at times, unbearably uncomfortable, connections have formed and strengthened in person. So what should I scale and what should I leave to slowly increase, decline, or even plateau? </span></p>\n<p><span style=\"font-weight: 400;\">I instinctually want to opt for a slow roll on human connectivity: The raw and ugly side of being human that we don’t tend to show online, that takes a bit to pull out of us. These are the parts of humanity that tech has yet to perfect. As a self-proclaimed thought-haver, this writing is allowing me to explore how someone (not a leader, just a thinker) can have something to say, and communicate it in a way that feels personal. At the end of the day, it’s still me, a person, writing what comes to my head (until Ex-Machina me takes over). </span></p>",
            "author": {
                "name": "Lauren Hinton"
            },
            "tags": [
            ],
            "date_published": "2025-12-02T11:15:19-05:00",
            "date_modified": "2025-12-30T11:08:49-05:00"
        },
        {
            "id": "https://laurenhinton.co/when-is-failure-a-success.html",
            "url": "https://laurenhinton.co/when-is-failure-a-success.html",
            "title": "When Is Failure A Success?",
            "summary": "When Is Failure A Success? August 13, 2025 Keeping to the theme of last week’s opening, I will start with&hellip;",
            "content_html": "<h1 class=\"lh-post-title-heading\">When Is Failure A Success?</h1>\n<div class=\"lh-post-date-single\">August 13, 2025</div>\n<p><span style=\"font-weight: 400;\">Keeping to the theme of last week’s opening, I will start with a conversation I had with my manager last week, side-eye abstained. We discussed some avenues where my writing could go. Should the series be, completely random, a continuous proclamation of sorts to inspire the masses? I’m still toying with my vision for this, but Joe asked a question that gave me some direction: “what do you like to read”? </span></p>\n<p><span style=\"font-weight: 400;\">In my head, the immediate answer was a jumbled genre of sci-fy-historic-action-romance-fiction-esque-empowering-biographies. When I thought about it for .5 more seconds, I concluded what reels me in, from a non-fiction POV, are the stories of silent tenacity. </span></p>\n<p><span style=\"font-weight: 400;\">I love a tale of perseverance, especially those tales that are often not told. What I mean by this is that I find it fascinating to uncover stories that people share long after their trials have become triumphs. I enjoy these stories so much because they are rooted in failure, and reading about someone else’s failure makes me feel less bad about my own. It also begs the question of whether “failure” is really a stagnant state, given that it often is the predecessor to something exciting.</span></p>\n<p><span style=\"font-weight: 400;\">I think these seemingly stagnant states of failure are often felt by each party in our ecosystem, investors and founders alike. Founders are more boisterous about it because, let’s face it, failure makes for a great come-back narrative, and everyone loves a relentless founder who “defied all the odds.” Investors, to everyone’s surprise, experience these stagnant states as well.</span></p>\n<p><span style=\"font-weight: 400;\">There are a multitude of scenarios where the F word came into play in my life. There are almost too many stories to share, but the one that’is the most profane is the failure that would morph into my first paid job. In Common App style, let’s go down the rabbit hole of my ambitious attempt to become a professional athlete. </span></p>\n<p><span style=\"font-weight: 400;\">For some context, my juvenile and collegiate career as an athlete was decimated by relentless injury. I had a back fracture, an ACL tear, foot ligaments stretched, another ACL tear, a pilonidal cyst (steer clear of that google search), ankle problems, and to top it all off, another ACL tear. The sports gods granted me the grace of finishing my sport while still standing, and in response I decided to keep pushing my luck. I turned down a full-time job to pursue a career where a key prerequisite was being healthy: professional soccer. Needless to say, my phone was not blowing up with offers. In the interim, to earn some money, and to distract myself from my phone not ringing, I joined a startup. </span></p>\n<p><span style=\"font-weight: 400;\">Joining the startup didn’t feel like a monumental decision, and yet it was the first domino to fall in a series of serendipitous developments that led me to the venture space. To save some time, I’ll condense the journey, and relay that joining the startup led me to working at an accelerator which led me to my first VC role which would subsequently lead to my current VC role. All due to being a terrible ROI in the eyes of pro scouts. </span></p>\n<p><span style=\"font-weight: 400;\">The failure to make it professionally has since paved my way into a career I'm still navigating, where failure is viewed almost as a rite of passage. I’m not sure if I’m as comfortable with failure as I want to be, and I’m also not sure if that’s necessarily a bad thing. </span></p>\n<p><span style=\"font-weight: 400;\">Losing a game, or losing your ability to walk without crutches, is a form of failure that, in a weird way, is short-term. You know there will be other games, and you hopefully have a great PT specialist that will get you walking in 4-6 weeks. Failure in career ambitions does not always have that near-term light at the end of the tunnel. You’re often left thinking “what now?”, and it can be months or years until that next path forward presents itself. </span></p>\n<p><span style=\"font-weight: 400;\">Professional failures are disheartening, and often lonely. They’re definitely not something you want to reflect on immediately, write down, and read the next day! </span></p>\n<p><span style=\"font-weight: 400;\">But perceived failure, whether good or bad, ultimately culminates in a future state that is (hopefully) better than the present. To that point, I’m going to advise my three readers to start thinking of professional failures like ACL tears. Extremely painful and exhausting to manage but, in the end, a temporary stagnant state, a short term detour from where you’re heading next. But at the same time, recovery is not straightforward and in that process you may end up in a completely different destination than you intended. And this can be a good thing. To the dreaded “F word” that derailed all my plans: a delayed thank you, for the nudge to trade in my cleats for term sheets. </span></p>",
            "author": {
                "name": "Lauren Hinton"
            },
            "tags": [
            ],
            "date_published": "2025-12-02T11:14:48-05:00",
            "date_modified": "2025-12-02T13:29:29-05:00"
        },
        {
            "id": "https://laurenhinton.co/the-prequel-to-partner.html",
            "url": "https://laurenhinton.co/the-prequel-to-partner.html",
            "title": "The Prequel to Partner",
            "summary": "The Prequel to Partner August 20, 2025 To be or not to be…a junior VC. I’m going to open by&hellip;",
            "content_html": "<h1 class=\"lh-post-title-heading\">The Prequel to Partner</h1>\n<div class=\"lh-post-date-single\">August 20, 2025</div>\n<p><span style=\"font-weight: 400;\">To be or not to be…a junior VC. I’m going to open by saying that this is not meant to read as ingratitude for the position I’m in. The point of this writing is to touch on the industry as a whole, rather than my personal experience. </span></p>\n<p><span style=\"font-weight: 400;\">Phewf, now that the disclaimer is out of the way, we can get into the good stuff. </span></p>\n<p><span style=\"font-weight: 400;\">To be or not to be…a junior VC. HOT TAKE: I can argue why being a junior VC is the coolest job on the market while simultaneously planting my flag in the camp that a junior VC role does not always reflect the hype it elicits.</span></p>\n<p><span style=\"font-weight: 400;\">They say you should save the best for last, but I’m going to go through the best parts first. In a very strange way, junior VCs are the gatekeepers to a lot of General Partners (GPs). The first day on the job, we may not know what the phrase “2 on 20” means, but we sure do know that the GP’s time is way more valuable than our own. A GP wants to be flagged with the good stuff, and a baby VC is typically their screener. Now, whether we actually know where to look is a whole other rabbit hole, but the point is that we get to meet a lot of really interesting and intelligent people. Plus, the GPs bestow a small ounce of trust upon us that we’ll know when there is lightning in a bottle. </span></p>\n<p><span style=\"font-weight: 400;\">I think that’s pretty cool. I also think that we are less susceptible to venture pattern-matching as naive, dow-eyed VCs. Most of us haven’t been around long enough to see our investments succeed or to recognize when someone is on the cusp of success, and there is opportunity in a fresh perspective. Intrinsically, we want to prove our worth, and we don’t know what we don’t know (yet). </span></p>\n<p><span style=\"font-weight: 400;\">So we take calls, go to events, talk to people on the street. We morph our whole lives into venture – seeking that coveted deal that will ascend through the firm and eventually make its way to the only part of the CRM the GP knows how to operate. More eyeballs in front of deals, and more deals to bring up in everyday conversation; “What would you like to drink?” a friend asks, “Well, I met this founder who is building something really cool in the liquid protein space.” It's an inevitable cringe, but one that keeps deals flowing. Getting to meet and work with founders, even if you don’t ultimately invest, is one of my favorite things. </span></p>\n<p><span style=\"font-weight: 400;\">Cringe aside, this all doesn’t sound so bad, yet most people don’t stay. The open operating role for the company fresh off their Series A whispers in an investor’s ear, or the thought of not attending another founder/funder happy hour drives people to a different industry altogether. As we’ve been anticipating, this is where we touch on the not-so-fun times in the life of a junior VC:</span></p>\n<p><span style=\"font-weight: 400;\">It’s hard to tell, sometimes, if we are the gatekeepers or the gatekept in the structure of a fund. </span></p>\n<p><span style=\"font-weight: 400;\">Is it possible to learn how to become a savvy investor when there are often no formal teachers, especially when starting from scratch? GPs have founders to fund and Hampton’s houses to buy, and there is simply not enough time in the day. So where does that leave a junior VC? As the lowest on the totem pole, you may always be sourcing and forming transactional relationships as opposed to career connections. Alternatively, you might live in the back office of the diligence team, grinding away, never to get a whiff of a newly marked-up term sheet. </span></p>\n<p><span style=\"font-weight: 400;\">Most fall somewhere in between those two roles. A lack of structure and constant ambiguity keep the industry thriving, but it remains brutal for someone navigating it at the beginning of their career. It takes time to refine your evaluation of a deal or a founder, and to learn from those around you. Like many founder &amp; VC relationships, the incentives are not always aligned. Success in venture is measured by deals. Bring in a perceived good deal? Promotion. Structure a deal in the firm's favor? Big applause for you. Manage a junior VC to think critically throughout the diligence process, from sourcing to signing? Zilch. So when should you enter the venture realm, and is there an argument to be made that bypassing the junior role altogether is more beneficial? Maybe. </span></p>\n<p><span style=\"font-weight: 400;\">Many people within venture – because who else would write about this? – would suggest that the best route to becoming a reputable investor is to have successful angel investments or become an operator before arriving at the VC seat. For those of us who have entered on an earlier timeline, though, it's a tricky one to navigate. You feel like you know a lot when you really know nothing, and you’re recommending or not recommending things as though you were buying Apple stock back in the 90’s. </span></p>\n<p><span style=\"font-weight: 400;\">It’s a weird state to be in. You’re seemingly an expert at many things, which can be misleading when deciphering what you </span><i><span style=\"font-weight: 400;\">actually</span></i><span style=\"font-weight: 400;\"> know, and what you need to learn next.</span></p>\n<p><span style=\"font-weight: 400;\">To be or not to be a junior VC…that is the question.</span></p>",
            "author": {
                "name": "Lauren Hinton"
            },
            "tags": [
            ],
            "date_published": "2025-12-02T11:13:57-05:00",
            "date_modified": "2025-12-02T13:29:48-05:00"
        },
        {
            "id": "https://laurenhinton.co/the-undeniable-linkage-between-startups-and-fantasy-football.html",
            "url": "https://laurenhinton.co/the-undeniable-linkage-between-startups-and-fantasy-football.html",
            "title": "The Undeniable Linkage Between Startups &amp; Fantasy Football",
            "summary": "The Undeniable Linkage Between Startups &amp; Fantasy Football October 1, 2025 I’ve been away the past month and I wish&hellip;",
            "content_html": "<h1 class=\"lh-post-title-heading\">The Undeniable Linkage Between Startups &amp; Fantasy Football</h1>\n<div class=\"lh-post-date-single\">October 1, 2025</div>\n<p><span style=\"font-weight: 400;\">I’ve been away the past month and I wish I could say it was due to vacation. Alas, the Euro summer will have to wait, as I’ve been doing 637289129 other things that didn’t allow for the self-indulgence of writing with the expectation that someone might actually read it. Tragic!</span></p>\n<p><span style=\"font-weight: 400;\">Have no fear, dear readers, the thought-haver has emerged from thinklessness and it’s time to put fingers to keyboard once more. </span></p>\n<p><span style=\"font-weight: 400;\">Fair warning: the next couple pieces will most likely be sports-related and this current piece is 100% sports-related, so if that is a snooze fest for you, I advise you read no further. Welcome to my fall thoughts. </span></p>\n<p><span style=\"font-weight: 400;\">It’s yet to be decided on whether football signals the start of fall or fall signals the start of football. “Football” in this context being American football and “fall” being the first Thursday in September. </span></p>\n<p><span style=\"font-weight: 400;\">Regardless, the false fall that is the first week in September is a fun one for me. I grew up in the south and there is little that holds a candle to Friday Night Lights and the start of the season naivete that the Cowboys will be conference champs. The intensity, and arguably obsession, that fans hold for their teams is unmatched. Sundays are for worship and the place of worship is any given living room or local bar that has the game on. </span></p>\n<p><span style=\"font-weight: 400;\">This year, I did something I have never done before: I joined a fantasy football league. I’ll admit, I never understood the appeal of “fantasy” until about a year ago when I caught myself asking questions about the logistics of being in a league. “How does the waiver wire work?” “Is there a punishment for last place?” “Just </span><i><span style=\"font-weight: 400;\">how </span></i><span style=\"font-weight: 400;\">committed does one have to be to operate a fantasy team?” Turns out a few of my other friends had secretly been thinking of joining a league, and a few of their friends were also curious about how fantasy works, and then three of their friends actually downloaded the app. Before I knew it, I was in a group chat with eleven other fantasy-curious types, participating in a 9pm draft the day before the 2025 NFL season, officially joining the inaugural season of the “Girls 4 Analytics” fantasy football league. </span></p>\n<p><span style=\"font-weight: 400;\">As we were going through our draft, some auto drafting while others quickly texted screenshots to their more football-inclined partners, my mind drifted and began connecting fantasy football to startups. Venture has a weird way of creeping into every single detail of your life, whether intentional or not. On this intrusive occasion, I found myself thinking about it for an absurd amount of time. </span></p>\n<p><span style=\"font-weight: 400;\">It sounds silly, but doesn’t the first step of fantasy football (the draft) kind of feel like investing in pre-seed startups? To state the most obvious, it’s all about the player. You’re coming into a draft having ideally done your research, some may call it “diligence,” on various players. For the risk lovers, there are new players out there trying to make a name for themselves, but the more risk-averse have the option of going with a proven vet, a player that has a track record of putting up great stats. Each player brings a unique skill set to the table and there are a finite amount of players to choose from. Not everyone can get a piece of Saquon (Barkley, Eagles stud) and you can’t draft only running backs. You need strength across a variety of player positions to have any chance at accumulating points…diversification, if you will. The similarities do not end at the conclusion of the draft.</span></p>\n<p><span style=\"font-weight: 400;\">Once you have your team *cough* *portfolio*, then the real game begins. You’re immediately matched up against someone in your league and are inundated with data. You’re given statistics such as the likelihood you win that week’s matchup, the start percentage of the player you chose, and the projected points for your team that week. It’s equally impressive and intimidating. Most startups have little to no data, but the similarity here is that startups are always competing. Companies are using every bit of information they have to make decisions that will give them an edge over their competition. And so are their investors. The details matter, and even a single percentage point can make all the difference. </span></p>\n<p><span style=\"font-weight: 400;\">A fantasy team quickly starts to reveal which players are consistent point-producers and which ones may need extra time to find their fit. It’s not instantaneous, but I’m a few weeks in and I can already start to see which players on my team (portfolio) stand out, which might plateau, or be underperformers. Similar to an investor’s partnership with a startup, there is a chance to intervene. You can swap players out and try a different strategy for the week. This is an art not a science, but there is something to say about a pivot. You can trade players with others in your league which requires advanced negotiation skills and valuing what is a “fair” trade. After all, secondaries can be a very tricky business. It’s a long season and remaining attentive to your team and knowing how to best support your lineup is a crucial part of the fantasy commitment. </span></p>\n<p><span style=\"font-weight: 400;\">If you aren’t following my train of thought, well, you’re not the first but let me share my last connection to what I believe is very similar to my line of work: Both fantasy football and investing in startups have long feedback loops. The choices you make in September are not fully celebrated or criticized until February. The choices you make to invest in a startup are not fully deemed a success or a failure until year seven or ten. How do you know if your choice at that moment was the right one? That the player you picked is going to be the returner, the one that gives you all the points? Does anyone </span><i><span style=\"font-weight: 400;\">really</span></i><span style=\"font-weight: 400;\"> know? Not in the beginning, at least.</span></p>\n<p><span style=\"font-weight: 400;\">So why do people keep coming back to fantasy football when their odds to win are slim, there is constant competition, and the season is full of uncertainty? And is the strategy based more on luck or skill? These same questions can be posed to investing in startups, especially startups at the earliest stages. I think the answer lies in the desire to be a part of something great (dramatic for fantasy football, but stick with me). People draft players they believe in and people back companies at the earliest stages that they see extreme potential in. Each draft, or check wire, is a bet in itself and one worth waiting to watch unfold over the course of six months or seven years. </span></p>\n<p><span style=\"font-weight: 400;\">Lastly, I would be remiss not to mention the role of luck in both fantasy football and startups. There is skill in choosing the right player or the right company to back, but there is also luck in a player staying healthy all season and a company building at the right time. People will keep playing fantasy and investors will keep investing in startups, and whether the end results reflect luck or skill is still an open question. I do think about this a lot, probably too much, the balance between luck and skill. It’s too soon to say which of the two will influence the rankings most in the Girls 4 Analytics league, but all I can say is that I got super lucky to land the #1 pick for our draft and I’m also 0-4 for the year. </span></p>",
            "author": {
                "name": "Lauren Hinton"
            },
            "tags": [
            ],
            "date_published": "2025-12-02T11:12:47-05:00",
            "date_modified": "2025-12-02T13:30:40-05:00"
        }
    ]
}
